In [41]:
import pandas as pd

In [42]:
df = pd.read_csv("students.csv")

In [43]:
df

   StudentID    Name Gender  Math  Science  English  Attendance    JoinDate
0          1   Aarav      M    78     85.0     88.0        90.0  2023-06-01
1          2    Diya      F    92     89.0      NaN        95.0  2023-06-15
2          3   Rohan      M    65     70.0     72.0         NaN  2023-07-10
3          4  Ananya      F    88     91.0     94.0        92.0  2023-05-20
4          5   Kabir      M    55      NaN     60.0        85.0  2023-08-01

In [44]:
df.shape

(5, 8)

In [45]:
df.columns

Index(['StudentID', 'Name', 'Gender', 'Math', 'Science', 'English',
       'Attendance', 'JoinDate'],
      dtype='object')

In [46]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   StudentID   5 non-null      int64
 1   Name        5 non-null      object
 2   Gender      5 non-null      object
 3   Math        5 non-null      int64
 4   Science     4 non-null      float64
 5   English     4 non-null      float64
 6   Attendance  4 non-null      float64
 7   JoinDate    5 non-null      object
dtypes: float64(3), int64(2), object(3)
memory usage: 452.0+ bytes

In [47]:
df.describe()

       StudentID       Math  Science    English  Attendance
count   5.000000   5.000000     4.00   4.000000    4.000000
mean    3.000000  75.600000    83.75  78.500000   90.500000
std     1.581139  15.533834     9.50  15.438048    4.203173
min     1.000000  55.000000    70.00  60.000000   85.000000
25%     2.000000  65.000000    81.25  69.000000   88.750000
50%     3.000000  78.000000    87.00  80.000000   91.000000
75%     4.000000  88.000000    89.50  89.500000   92.750000
max     5.000000  92.000000    91.00  94.000000   95.000000

In [48]:
df.isnull().sum()

StudentID     0
Name          0
Gender        0
Math          0
Science       1
English       1
Attendance    1
JoinDate      0
dtype: int64

In [49]:
df["Science"] = pd.to_numeric(df["Science"], errors="coerce")

In [50]:
df.fillna({
    "Science" : 0,
    "English" : 0,
    "Attendance" : df["Attendance"].mean()
}, inplace = True)

In [51]:
df

   StudentID    Name Gender  Math  Science  English  Attendance    JoinDate
0          1   Aarav      M    78     85.0     88.0        90.0  2023-06-01
1          2    Diya      F    92     89.0      0.0        95.0  2023-06-15
2          3   Rohan      M    65     70.0     72.0        90.5  2023-07-10
3          4  Ananya      F    88     91.0     94.0        92.0  2023-05-20
4          5   Kabir      M    55      0.0     60.0        85.0  2023-08-01

In [52]:
df["JoinDate"] = pd.to_datetime(df["JoinDate"])

In [53]:
df

   StudentID    Name Gender  Math  Science  English  Attendance   JoinDate
0          1   Aarav      M    78     85.0     88.0        90.0 2023-06-01
1          2    Diya      F    92     89.0      0.0        95.0 2023-06-15
2          3   Rohan      M    65     70.0     72.0        90.5 2023-07-10
3          4  Ananya      F    88     91.0     94.0        92.0 2023-05-20
4          5   Kabir      M    55      0.0     60.0        85.0 2023-08-01

In [54]:
df["Total"] = df[["Math", "Science", "English"]].sum(axis = 1)

In [55]:
df["Average"] = df["Total"]/3

In [63]:
df["Performance"] = df["Average"].apply(
    lambda x: "Excellent" if x >= 90 else "Good" if x >= 50 else "Failed" 
)

In [61]:
df[df["Attendance"] < 90]

,StudentID,Name,Gender,Math,Science,English,Attendance,JoinDate,Total,Average,Performance
4,5,Kabir,M,55,0.0,60.0,85.0,2023-08-01,115.0,38.333333,Failed

In [62]:
df[df["Performance"] == "Excellent"]

,StudentID,Name,Gender,Math,Science,English,Attendance,JoinDate,Total,Average,Performance
3,4,Ananya,F,88,91.0,94.0,92.0,2023-05-20,273.0,91.0,Excellent

In [66]:
df.groupby("Gender")["Average"].mean()

Gender
F    75.666667
M    63.666667
Name: Average, dtype: float64

In [67]:
df.groupby("Gender")[["Math","Science","English"]].mean()

        Math    Science    English
Gender
F       90.0  90.000000  47.000000
M       66.0  51.666667  73.333333

In [68]:
df["Performance"].value_counts()

Performance
Good         3
Excellent    1
Failed       1
Name: count, dtype: int64

In [69]:
df.loc[df["Average"] > 80, ["Name","Average","Performance"]]

     Name    Average Performance
0   Aarav  83.666667        Good
3  Ananya  91.000000   Excellent

In [70]:
df.rename(columns={"Attendance":"Attendance_Percentage"}, inplace=True)

In [71]:
df

,StudentID,Name,Gender,Math,Science,English,Attendance_Percentage,JoinDate,Total,Average,Performance
0,1,Aarav,M,78,85.0,88.0,90.0,2023-06-01,251.0,83.666667,Good
1,2,Diya,F,92,89.0,0.0,95.0,2023-06-15,181.0,60.333333,Good
2,3,Rohan,M,65,70.0,72.0,90.5,2023-07-10,207.0,69.000000,Good
3,4,Ananya,F,88,91.0,94.0,92.0,2023-05-20,273.0,91.000000,Excellent
4,5,Kabir,M,55,0.0,60.0,85.0,2023-08-01,115.0,38.333333,Failed

In [74]:
df.to_csv("cleaned_students.csv", index=False)

Final Insights:

1. Attendence below than 90% often lead to a poor performance
2. Female students have higher average than the male students
3. Female students have a higher scores but in math and science but in enlish they didn't perform well
4. Male students have perform poorly on math and science but in english their performace is good.
5. English scores are highest on average
6. Performance strongly correlates with attendance.